espressif/esp-idf/components/soc/esp32c61/register/soc/pcr_reg.h
/** PCR_I2C_SCLK_CONF_REG register
 *  I2C_SCLK configuration register
 */
#define PCR_I2C_SCLK_CONF_REG (DR_REG_PCR_BASE + 0x30)
/** PCR_I2C_SCLK_DIV_A : R/W; bitpos: [5:0]; default: 0;
 *  The  denominator of the frequency divider factor of the i2c function clock.
 */
#define PCR_I2C_SCLK_DIV_A    0x0000003FU
#define PCR_I2C_SCLK_DIV_A_M  (PCR_I2C_SCLK_DIV_A_V << PCR_I2C_SCLK_DIV_A_S)
#define PCR_I2C_SCLK_DIV_A_V  0x0000003FU
#define PCR_I2C_SCLK_DIV_A_S  0
/** PCR_I2C_SCLK_DIV_B : R/W; bitpos: [11:6]; default: 0;
 *  The numerator of the frequency divider factor of the i2c function clock.
 */
#define PCR_I2C_SCLK_DIV_B    0x0000003FU
#define PCR_I2C_SCLK_DIV_B_M  (PCR_I2C_SCLK_DIV_B_V << PCR_I2C_SCLK_DIV_B_S)
#define PCR_I2C_SCLK_DIV_B_V  0x0000003FU
#define PCR_I2C_SCLK_DIV_B_S  6
/** PCR_I2C_SCLK_DIV_NUM : R/W; bitpos: [19:12]; default: 0;
 *  The integral part of the frequency divider factor of the i2c function clock.
 */
#define PCR_I2C_SCLK_DIV_NUM    0x000000FFU
#define PCR_I2C_SCLK_DIV_NUM_M  (PCR_I2C_SCLK_DIV_NUM_V << PCR_I2C_SCLK_DIV_NUM_S)
#define PCR_I2C_SCLK_DIV_NUM_V  0x000000FFU
#define PCR_I2C_SCLK_DIV_NUM_S  12
/** PCR_I2C_SCLK_SEL : R/W; bitpos: [20]; default: 0;
 *  Configures the clock source of I2C.
 *  0 (default): XTAL_CLK
 *  1: RC_FAST_CLK
 */
#define PCR_I2C_SCLK_SEL    (BIT(20))
#define PCR_I2C_SCLK_SEL_M  (PCR_I2C_SCLK_SEL_V << PCR_I2C_SCLK_SEL_S)
#define PCR_I2C_SCLK_SEL_V  0x00000001U
#define PCR_I2C_SCLK_SEL_S  20
/** PCR_I2C_SCLK_EN : R/W; bitpos: [22]; default: 1;
 *  Set 1 to enable i2c function clock
 */
#define PCR_I2C_SCLK_EN    (BIT(22))
#define PCR_I2C_SCLK_EN_M  (PCR_I2C_SCLK_EN_V << PCR_I2C_SCLK_EN_S)
#define PCR_I2C_SCLK_EN_V  0x00000001U
#define PCR_I2C_SCLK_EN_S  22

/** PCR_LEDC_CONF_REG register
 *  LEDC configuration register
 */
#define PCR_LEDC_CONF_REG (DR_REG_PCR_BASE + 0x34)
/** PCR_LEDC_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable ledc apb clock
 */
#define PCR_LEDC_CLK_EN    (BIT(0))
#define PCR_LEDC_CLK_EN_M  (PCR_LEDC_CLK_EN_V << PCR_LEDC_CLK_EN_S)
#define PCR_LEDC_CLK_EN_V  0x00000001U
#define PCR_LEDC_CLK_EN_S  0
/** PCR_LEDC_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset ledc module
 */
#define PCR_LEDC_RST_EN    (BIT(1))
#define PCR_LEDC_RST_EN_M  (PCR_LEDC_RST_EN_V << PCR_LEDC_RST_EN_S)
#define PCR_LEDC_RST_EN_V  0x00000001U
#define PCR_LEDC_RST_EN_S  1
/** PCR_LEDC_READY : RO; bitpos: [2]; default: 1;
 *  Query this field after reset ledc module
 */
#define PCR_LEDC_READY    (BIT(2))
#define PCR_LEDC_READY_M  (PCR_LEDC_READY_V << PCR_LEDC_READY_S)
#define PCR_LEDC_READY_V  0x00000001U
#define PCR_LEDC_READY_S  2

/** PCR_LEDC_SCLK_CONF_REG register
 *  LEDC_SCLK configuration register
 */
#define PCR_LEDC_SCLK_CONF_REG (DR_REG_PCR_BASE + 0x38)
/** PCR_LEDC_SCLK_SEL : R/W; bitpos: [21:20]; default: 0;
 *  Configures the clock source of LEDC.
 *  0 (default): XTAL_CLK
 *  1: RC_FAST_CLK
 *  2: PLL_F80M_CLK
 */
#define PCR_LEDC_SCLK_SEL    0x00000003U
#define PCR_LEDC_SCLK_SEL_M  (PCR_LEDC_SCLK_SEL_V << PCR_LEDC_SCLK_SEL_S)
#define PCR_LEDC_SCLK_SEL_V  0x00000003U
#define PCR_LEDC_SCLK_SEL_S  20
/** PCR_LEDC_SCLK_EN : R/W; bitpos: [22]; default: 1;
 *  Set 1 to enable ledc function clock
 */
#define PCR_LEDC_SCLK_EN    (BIT(22))
#define PCR_LEDC_SCLK_EN_M  (PCR_LEDC_SCLK_EN_V << PCR_LEDC_SCLK_EN_S)
#define PCR_LEDC_SCLK_EN_V  0x00000001U
#define PCR_LEDC_SCLK_EN_S  22

/** PCR_LEDC_PD_CTRL_REG register
 *  LEDC power control register
 */
#define PCR_LEDC_PD_CTRL_REG (DR_REG_PCR_BASE + 0x3c)
/** PCR_LEDC_MEM_FORCE_PU : R/W; bitpos: [1]; default: 1;
 *  Set this bit to force power down LEDC memory.
 */
#define PCR_LEDC_MEM_FORCE_PU    (BIT(1))
#define PCR_LEDC_MEM_FORCE_PU_M  (PCR_LEDC_MEM_FORCE_PU_V << PCR_LEDC_MEM_FORCE_PU_S)
#define PCR_LEDC_MEM_FORCE_PU_V  0x00000001U
#define PCR_LEDC_MEM_FORCE_PU_S  1
/** PCR_LEDC_MEM_FORCE_PD : R/W; bitpos: [2]; default: 0;
 *  Set this bit to force power up LEDC memory.
 */
#define PCR_LEDC_MEM_FORCE_PD    (BIT(2))
#define PCR_LEDC_MEM_FORCE_PD_M  (PCR_LEDC_MEM_FORCE_PD_V << PCR_LEDC_MEM_FORCE_PD_S)
#define PCR_LEDC_MEM_FORCE_PD_V  0x00000001U
#define PCR_LEDC_MEM_FORCE_PD_S  2

/** PCR_TIMERGROUP0_CONF_REG register
 *  TIMERGROUP0 configuration register
 */
#define PCR_TIMERGROUP0_CONF_REG (DR_REG_PCR_BASE + 0x40)
/** PCR_TG0_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable timer_group0 apb clock
 */
#define PCR_TG0_CLK_EN    (BIT(0))
#define PCR_TG0_CLK_EN_M  (PCR_TG0_CLK_EN_V << PCR_TG0_CLK_EN_S)
#define PCR_TG0_CLK_EN_V  0x00000001U
#define PCR_TG0_CLK_EN_S  0
/** PCR_TG0_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset timer_group0 module
 */
#define PCR_TG0_RST_EN    (BIT(1))
#define PCR_TG0_RST_EN_M  (PCR_TG0_RST_EN_V << PCR_TG0_RST_EN_S)
#define PCR_TG0_RST_EN_V  0x00000001U
#define PCR_TG0_RST_EN_S  1
/** PCR_TG0_WDT_READY : RO; bitpos: [2]; default: 1;
 *  Query this field after reset timer_group0 wdt module
 */
#define PCR_TG0_WDT_READY    (BIT(2))
#define PCR_TG0_WDT_READY_M  (PCR_TG0_WDT_READY_V << PCR_TG0_WDT_READY_S)
#define PCR_TG0_WDT_READY_V  0x00000001U
#define PCR_TG0_WDT_READY_S  2
/** PCR_TG0_TIMER0_READY : RO; bitpos: [3]; default: 1;
 *  Query this field after reset timer_group0 timer0 module
 */
#define PCR_TG0_TIMER0_READY    (BIT(3))
#define PCR_TG0_TIMER0_READY_M  (PCR_TG0_TIMER0_READY_V << PCR_TG0_TIMER0_READY_S)
#define PCR_TG0_TIMER0_READY_V  0x00000001U
#define PCR_TG0_TIMER0_READY_S  3
/** PCR_TG0_TIMER1_READY : RO; bitpos: [4]; default: 1;
 *  reserved
 */
#define PCR_TG0_TIMER1_READY    (BIT(4))
#define PCR_TG0_TIMER1_READY_M  (PCR_TG0_TIMER1_READY_V << PCR_TG0_TIMER1_READY_S)
#define PCR_TG0_TIMER1_READY_V  0x00000001U
#define PCR_TG0_TIMER1_READY_S  4

/** PCR_TIMERGROUP0_TIMER_CLK_CONF_REG register
 *  TIMERGROUP0_TIMER_CLK configuration register
 */
#define PCR_TIMERGROUP0_TIMER_CLK_CONF_REG (DR_REG_PCR_BASE + 0x44)
/** PCR_TG0_TIMER_CLK_SEL : R/W; bitpos: [21:20]; default: 0;
 *  Configures the clock source of general-purpose timers in Timer Group 0.
 *  0 (default): XTAL_CLK
 *  1: RC_FAST_CLK
 *  2: PLL_F80M_CLK
 */
#define PCR_TG0_TIMER_CLK_SEL    0x00000003U
#define PCR_TG0_TIMER_CLK_SEL_M  (PCR_TG0_TIMER_CLK_SEL_V << PCR_TG0_TIMER_CLK_SEL_S)
#define PCR_TG0_TIMER_CLK_SEL_V  0x00000003U
#define PCR_TG0_TIMER_CLK_SEL_S  20
/** PCR_TG0_TIMER_CLK_EN : R/W; bitpos: [22]; default: 1;
 *  Set 1 to enable timer_group0 timer clock
 */
#define PCR_TG0_TIMER_CLK_EN    (BIT(22))
#define PCR_TG0_TIMER_CLK_EN_M  (PCR_TG0_TIMER_CLK_EN_V << PCR_TG0_TIMER_CLK_EN_S)
#define PCR_TG0_TIMER_CLK_EN_V  0x00000001U
#define PCR_TG0_TIMER_CLK_EN_S  22

/** PCR_TIMERGROUP0_WDT_CLK_CONF_REG register
 *  TIMERGROUP0_WDT_CLK configuration register
 */
#define PCR_TIMERGROUP0_WDT_CLK_CONF_REG (DR_REG_PCR_BASE + 0x48)
/** PCR_TG0_WDT_CLK_SEL : R/W; bitpos: [21:20]; default: 0;
 *  Configures the clock source of WDT in Timer Group 0.
 *  0 (default): XTAL_CLK
 *  1: RC_FAST_CLK
 *  2: PLL_F80M_CLK
 */
#define PCR_TG0_WDT_CLK_SEL    0x00000003U
#define PCR_TG0_WDT_CLK_SEL_M  (PCR_TG0_WDT_CLK_SEL_V << PCR_TG0_WDT_CLK_SEL_S)
#define PCR_TG0_WDT_CLK_SEL_V  0x00000003U
#define PCR_TG0_WDT_CLK_SEL_S  20
/** PCR_TG0_WDT_CLK_EN : R/W; bitpos: [22]; default: 1;
 *  Set 1 to enable timer_group0 wdt clock
 */
#define PCR_TG0_WDT_CLK_EN    (BIT(22))
#define PCR_TG0_WDT_CLK_EN_M  (PCR_TG0_WDT_CLK_EN_V << PCR_TG0_WDT_CLK_EN_S)
#define PCR_TG0_WDT_CLK_EN_V  0x00000001U
#define PCR_TG0_WDT_CLK_EN_S  22

