espressif/esp-idf/components/soc/esp32c61/register/soc/pcr_reg.h
/** PCR_I2S_RX_CLKM_DIV_CONF_REG register
 *  I2S_RX_CLKM_DIV configuration register
 */
#define PCR_I2S_RX_CLKM_DIV_CONF_REG (DR_REG_PCR_BASE + 0x70)
/** PCR_I2S_RX_CLKM_DIV_Z : R/W; bitpos: [8:0]; default: 0;
 *  For b <= a/2, the value of I2S_RX_CLKM_DIV_Z is b. For b > a/2, the value of
 *  I2S_RX_CLKM_DIV_Z is (a-b).
 */
#define PCR_I2S_RX_CLKM_DIV_Z    0x000001FFU
#define PCR_I2S_RX_CLKM_DIV_Z_M  (PCR_I2S_RX_CLKM_DIV_Z_V << PCR_I2S_RX_CLKM_DIV_Z_S)
#define PCR_I2S_RX_CLKM_DIV_Z_V  0x000001FFU
#define PCR_I2S_RX_CLKM_DIV_Z_S  0
/** PCR_I2S_RX_CLKM_DIV_Y : R/W; bitpos: [17:9]; default: 1;
 *  For b <= a/2, the value of I2S_RX_CLKM_DIV_Y is (a%b) . For b > a/2, the value of
 *  I2S_RX_CLKM_DIV_Y is (a%(a-b)).
 */
#define PCR_I2S_RX_CLKM_DIV_Y    0x000001FFU
#define PCR_I2S_RX_CLKM_DIV_Y_M  (PCR_I2S_RX_CLKM_DIV_Y_V << PCR_I2S_RX_CLKM_DIV_Y_S)
#define PCR_I2S_RX_CLKM_DIV_Y_V  0x000001FFU
#define PCR_I2S_RX_CLKM_DIV_Y_S  9
/** PCR_I2S_RX_CLKM_DIV_X : R/W; bitpos: [26:18]; default: 0;
 *  For b <= a/2, the value of I2S_RX_CLKM_DIV_X is (a/b) - 1. For b > a/2, the value
 *  of I2S_RX_CLKM_DIV_X is (a/(a-b)) - 1.
 */
#define PCR_I2S_RX_CLKM_DIV_X    0x000001FFU
#define PCR_I2S_RX_CLKM_DIV_X_M  (PCR_I2S_RX_CLKM_DIV_X_V << PCR_I2S_RX_CLKM_DIV_X_S)
#define PCR_I2S_RX_CLKM_DIV_X_V  0x000001FFU
#define PCR_I2S_RX_CLKM_DIV_X_S  18
/** PCR_I2S_RX_CLKM_DIV_YN1 : R/W; bitpos: [27]; default: 0;
 *  For b <= a/2, the value of I2S_RX_CLKM_DIV_YN1 is 0 . For b > a/2, the value of
 *  I2S_RX_CLKM_DIV_YN1 is 1.
 */
#define PCR_I2S_RX_CLKM_DIV_YN1    (BIT(27))
#define PCR_I2S_RX_CLKM_DIV_YN1_M  (PCR_I2S_RX_CLKM_DIV_YN1_V << PCR_I2S_RX_CLKM_DIV_YN1_S)
#define PCR_I2S_RX_CLKM_DIV_YN1_V  0x00000001U
#define PCR_I2S_RX_CLKM_DIV_YN1_S  27

/** PCR_SARADC_CONF_REG register
 *  SARADC configuration register
 */
#define PCR_SARADC_CONF_REG (DR_REG_PCR_BASE + 0x74)
/** PCR_SARADC_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  no use
 */
#define PCR_SARADC_CLK_EN    (BIT(0))
#define PCR_SARADC_CLK_EN_M  (PCR_SARADC_CLK_EN_V << PCR_SARADC_CLK_EN_S)
#define PCR_SARADC_CLK_EN_V  0x00000001U
#define PCR_SARADC_CLK_EN_S  0
/** PCR_SARADC_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset function_register of saradc module
 */
#define PCR_SARADC_RST_EN    (BIT(1))
#define PCR_SARADC_RST_EN_M  (PCR_SARADC_RST_EN_V << PCR_SARADC_RST_EN_S)
#define PCR_SARADC_RST_EN_V  0x00000001U
#define PCR_SARADC_RST_EN_S  1
/** PCR_SARADC_REG_CLK_EN : R/W; bitpos: [2]; default: 1;
 *  Set 1 to enable saradc apb clock
 */
#define PCR_SARADC_REG_CLK_EN    (BIT(2))
#define PCR_SARADC_REG_CLK_EN_M  (PCR_SARADC_REG_CLK_EN_V << PCR_SARADC_REG_CLK_EN_S)
#define PCR_SARADC_REG_CLK_EN_V  0x00000001U
#define PCR_SARADC_REG_CLK_EN_S  2
/** PCR_SARADC_REG_RST_EN : R/W; bitpos: [3]; default: 0;
 *  Set 1 to reset apb_register of saradc module
 */
#define PCR_SARADC_REG_RST_EN    (BIT(3))
#define PCR_SARADC_REG_RST_EN_M  (PCR_SARADC_REG_RST_EN_V << PCR_SARADC_REG_RST_EN_S)
#define PCR_SARADC_REG_RST_EN_V  0x00000001U
#define PCR_SARADC_REG_RST_EN_S  3

/** PCR_SARADC_CLKM_CONF_REG register
 *  SARADC_CLKM configuration register
 */
#define PCR_SARADC_CLKM_CONF_REG (DR_REG_PCR_BASE + 0x78)
/** PCR_SARADC_CLKM_DIV_A : R/W; bitpos: [5:0]; default: 0;
 *  The  denominator of the frequency divider factor of the saradc function clock.
 */
#define PCR_SARADC_CLKM_DIV_A    0x0000003FU
#define PCR_SARADC_CLKM_DIV_A_M  (PCR_SARADC_CLKM_DIV_A_V << PCR_SARADC_CLKM_DIV_A_S)
#define PCR_SARADC_CLKM_DIV_A_V  0x0000003FU
#define PCR_SARADC_CLKM_DIV_A_S  0
/** PCR_SARADC_CLKM_DIV_B : R/W; bitpos: [11:6]; default: 0;
 *  The numerator of the frequency divider factor of the saradc function clock.
 */
#define PCR_SARADC_CLKM_DIV_B    0x0000003FU
#define PCR_SARADC_CLKM_DIV_B_M  (PCR_SARADC_CLKM_DIV_B_V << PCR_SARADC_CLKM_DIV_B_S)
#define PCR_SARADC_CLKM_DIV_B_V  0x0000003FU
#define PCR_SARADC_CLKM_DIV_B_S  6
/** PCR_SARADC_CLKM_DIV_NUM : R/W; bitpos: [19:12]; default: 4;
 *  The integral part of the frequency divider factor of the saradc function clock.
 */
#define PCR_SARADC_CLKM_DIV_NUM    0x000000FFU
#define PCR_SARADC_CLKM_DIV_NUM_M  (PCR_SARADC_CLKM_DIV_NUM_V << PCR_SARADC_CLKM_DIV_NUM_S)
#define PCR_SARADC_CLKM_DIV_NUM_V  0x000000FFU
#define PCR_SARADC_CLKM_DIV_NUM_S  12
/** PCR_SARADC_CLKM_SEL : R/W; bitpos: [21:20]; default: 0;
 *  Configures the clock source of SAR ADC.
 *  0 (default): XTAL_CLK
 *  1: RC_FAST_CLK
 *  2: PLL_F80M_CLK
 */
#define PCR_SARADC_CLKM_SEL    0x00000003U
#define PCR_SARADC_CLKM_SEL_M  (PCR_SARADC_CLKM_SEL_V << PCR_SARADC_CLKM_SEL_S)
#define PCR_SARADC_CLKM_SEL_V  0x00000003U
#define PCR_SARADC_CLKM_SEL_S  20
/** PCR_SARADC_CLKM_EN : R/W; bitpos: [22]; default: 1;
 *  Set 1 to enable saradc function clock
 */
#define PCR_SARADC_CLKM_EN    (BIT(22))
#define PCR_SARADC_CLKM_EN_M  (PCR_SARADC_CLKM_EN_V << PCR_SARADC_CLKM_EN_S)
#define PCR_SARADC_CLKM_EN_V  0x00000001U
#define PCR_SARADC_CLKM_EN_S  22

/** PCR_TSENS_CLK_CONF_REG register
 *  TSENS_CLK configuration register
 */
#define PCR_TSENS_CLK_CONF_REG (DR_REG_PCR_BASE + 0x7c)
/** PCR_TSENS_CLK_SEL : R/W; bitpos: [20]; default: 0;
 *  Configures the clock source of the temperature sensor.
 *  0 (default): XTAL_CLK
 *  1: RC_FAST_CLK
 */
#define PCR_TSENS_CLK_SEL    (BIT(20))
#define PCR_TSENS_CLK_SEL_M  (PCR_TSENS_CLK_SEL_V << PCR_TSENS_CLK_SEL_S)
#define PCR_TSENS_CLK_SEL_V  0x00000001U
#define PCR_TSENS_CLK_SEL_S  20
/** PCR_TSENS_CLK_EN : R/W; bitpos: [22]; default: 1;
 *  Set 1 to enable tsens clock
 */
#define PCR_TSENS_CLK_EN    (BIT(22))
#define PCR_TSENS_CLK_EN_M  (PCR_TSENS_CLK_EN_V << PCR_TSENS_CLK_EN_S)
#define PCR_TSENS_CLK_EN_V  0x00000001U
#define PCR_TSENS_CLK_EN_S  22
/** PCR_TSENS_RST_EN : R/W; bitpos: [23]; default: 0;
 *  Set 1 to reset tsens module
 */
#define PCR_TSENS_RST_EN    (BIT(23))
#define PCR_TSENS_RST_EN_M  (PCR_TSENS_RST_EN_V << PCR_TSENS_RST_EN_S)
#define PCR_TSENS_RST_EN_V  0x00000001U
#define PCR_TSENS_RST_EN_S  23

/** PCR_USB_DEVICE_CONF_REG register
 *  USB_DEVICE configuration register
 */
#define PCR_USB_DEVICE_CONF_REG (DR_REG_PCR_BASE + 0x80)
/** PCR_USB_DEVICE_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable usb_device clock
 */
#define PCR_USB_DEVICE_CLK_EN    (BIT(0))
#define PCR_USB_DEVICE_CLK_EN_M  (PCR_USB_DEVICE_CLK_EN_V << PCR_USB_DEVICE_CLK_EN_S)
#define PCR_USB_DEVICE_CLK_EN_V  0x00000001U
#define PCR_USB_DEVICE_CLK_EN_S  0
/** PCR_USB_DEVICE_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset usb_device module
 */
#define PCR_USB_DEVICE_RST_EN    (BIT(1))
#define PCR_USB_DEVICE_RST_EN_M  (PCR_USB_DEVICE_RST_EN_V << PCR_USB_DEVICE_RST_EN_S)
#define PCR_USB_DEVICE_RST_EN_V  0x00000001U
#define PCR_USB_DEVICE_RST_EN_S  1
/** PCR_USB_DEVICE_READY : RO; bitpos: [2]; default: 1;
 *  Query this field after reset usb_device module
 */
#define PCR_USB_DEVICE_READY    (BIT(2))
#define PCR_USB_DEVICE_READY_M  (PCR_USB_DEVICE_READY_V << PCR_USB_DEVICE_READY_S)
#define PCR_USB_DEVICE_READY_V  0x00000001U
#define PCR_USB_DEVICE_READY_S  2

/** PCR_INTMTX_CONF_REG register
 *  INTMTX configuration register
 */
#define PCR_INTMTX_CONF_REG (DR_REG_PCR_BASE + 0x84)
/** PCR_INTMTX_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable intmtx clock
 */
#define PCR_INTMTX_CLK_EN    (BIT(0))
#define PCR_INTMTX_CLK_EN_M  (PCR_INTMTX_CLK_EN_V << PCR_INTMTX_CLK_EN_S)
#define PCR_INTMTX_CLK_EN_V  0x00000001U
#define PCR_INTMTX_CLK_EN_S  0
/** PCR_INTMTX_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset intmtx module
 */
#define PCR_INTMTX_RST_EN    (BIT(1))
#define PCR_INTMTX_RST_EN_M  (PCR_INTMTX_RST_EN_V << PCR_INTMTX_RST_EN_S)
#define PCR_INTMTX_RST_EN_V  0x00000001U
#define PCR_INTMTX_RST_EN_S  1
/** PCR_INTMTX_READY : RO; bitpos: [2]; default: 1;
 *  Query this field after reset intmtx module
 */
#define PCR_INTMTX_READY    (BIT(2))
#define PCR_INTMTX_READY_M  (PCR_INTMTX_READY_V << PCR_INTMTX_READY_S)
#define PCR_INTMTX_READY_V  0x00000001U
#define PCR_INTMTX_READY_S  2

/** PCR_PVT_MONITOR_CONF_REG register
 *  PVT_MONITOR configuration register
 */
#define PCR_PVT_MONITOR_CONF_REG (DR_REG_PCR_BASE + 0x88)
/** PCR_PVT_MONITOR_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable apb clock of pvt module
 */
#define PCR_PVT_MONITOR_CLK_EN    (BIT(0))
#define PCR_PVT_MONITOR_CLK_EN_M  (PCR_PVT_MONITOR_CLK_EN_V << PCR_PVT_MONITOR_CLK_EN_S)
#define PCR_PVT_MONITOR_CLK_EN_V  0x00000001U
#define PCR_PVT_MONITOR_CLK_EN_S  0
/** PCR_PVT_MONITOR_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset all pvt monitor module
 */
#define PCR_PVT_MONITOR_RST_EN    (BIT(1))
#define PCR_PVT_MONITOR_RST_EN_M  (PCR_PVT_MONITOR_RST_EN_V << PCR_PVT_MONITOR_RST_EN_S)
#define PCR_PVT_MONITOR_RST_EN_V  0x00000001U
#define PCR_PVT_MONITOR_RST_EN_S  1
/** PCR_PVT_MONITOR_SITE2_CLK_EN : R/W; bitpos: [3]; default: 1;
 *  Set 1 to enable function clock of cpu pvt module
 */
#define PCR_PVT_MONITOR_SITE2_CLK_EN    (BIT(3))
#define PCR_PVT_MONITOR_SITE2_CLK_EN_M  (PCR_PVT_MONITOR_SITE2_CLK_EN_V << PCR_PVT_MONITOR_SITE2_CLK_EN_S)
#define PCR_PVT_MONITOR_SITE2_CLK_EN_V  0x00000001U
#define PCR_PVT_MONITOR_SITE2_CLK_EN_S  3
/** PCR_PVT_MONITOR_SITE2_RST_EN : R/W; bitpos: [4]; default: 0;
 *  Set 1 to reset cpu pvt monitor site
 */
#define PCR_PVT_MONITOR_SITE2_RST_EN    (BIT(4))
#define PCR_PVT_MONITOR_SITE2_RST_EN_M  (PCR_PVT_MONITOR_SITE2_RST_EN_V << PCR_PVT_MONITOR_SITE2_RST_EN_S)
#define PCR_PVT_MONITOR_SITE2_RST_EN_V  0x00000001U
#define PCR_PVT_MONITOR_SITE2_RST_EN_S  4
/** PCR_PVT_MONITOR_SITE3_CLK_EN : R/W; bitpos: [5]; default: 1;
 *  Set 1 to enable function clock of modem pvt module
 */
#define PCR_PVT_MONITOR_SITE3_CLK_EN    (BIT(5))
#define PCR_PVT_MONITOR_SITE3_CLK_EN_M  (PCR_PVT_MONITOR_SITE3_CLK_EN_V << PCR_PVT_MONITOR_SITE3_CLK_EN_S)
#define PCR_PVT_MONITOR_SITE3_CLK_EN_V  0x00000001U
#define PCR_PVT_MONITOR_SITE3_CLK_EN_S  5

/** PCR_PVT_MONITOR_FUNC_CLK_CONF_REG register
 *  PVT_MONITOR function clock configuration register
 */
#define PCR_PVT_MONITOR_FUNC_CLK_CONF_REG (DR_REG_PCR_BASE + 0x8c)
/** PCR_PVT_MONITOR_FUNC_CLK_DIV_NUM : R/W; bitpos: [3:0]; default: 0;
 *  The integral part of the frequency divider factor of the pvt_monitor function clock.
 */
#define PCR_PVT_MONITOR_FUNC_CLK_DIV_NUM    0x0000000FU
#define PCR_PVT_MONITOR_FUNC_CLK_DIV_NUM_M  (PCR_PVT_MONITOR_FUNC_CLK_DIV_NUM_V << PCR_PVT_MONITOR_FUNC_CLK_DIV_NUM_S)
#define PCR_PVT_MONITOR_FUNC_CLK_DIV_NUM_V  0x0000000FU
#define PCR_PVT_MONITOR_FUNC_CLK_DIV_NUM_S  0
/** PCR_PVT_MONITOR_FUNC_CLK_SEL : R/W; bitpos: [20]; default: 0;
 *  Configures the clock source of PVT MONITOR.
 *  0 (default): XTAL_CLK
 *  1: PLL_F160M_CLK
 */
#define PCR_PVT_MONITOR_FUNC_CLK_SEL    (BIT(20))
#define PCR_PVT_MONITOR_FUNC_CLK_SEL_M  (PCR_PVT_MONITOR_FUNC_CLK_SEL_V << PCR_PVT_MONITOR_FUNC_CLK_SEL_S)
#define PCR_PVT_MONITOR_FUNC_CLK_SEL_V  0x00000001U
#define PCR_PVT_MONITOR_FUNC_CLK_SEL_S  20
/** PCR_PVT_MONITOR_FUNC_CLK_EN : R/W; bitpos: [22]; default: 1;
 *  Set 1 to enable source clock of pvt sitex
 */
#define PCR_PVT_MONITOR_FUNC_CLK_EN    (BIT(22))
#define PCR_PVT_MONITOR_FUNC_CLK_EN_M  (PCR_PVT_MONITOR_FUNC_CLK_EN_V << PCR_PVT_MONITOR_FUNC_CLK_EN_S)
#define PCR_PVT_MONITOR_FUNC_CLK_EN_V  0x00000001U
#define PCR_PVT_MONITOR_FUNC_CLK_EN_S  22

/** PCR_GDMA_CONF_REG register
 *  GDMA configuration register
 */
#define PCR_GDMA_CONF_REG (DR_REG_PCR_BASE + 0x90)
/** PCR_GDMA_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable gdma clock
 */
#define PCR_GDMA_CLK_EN    (BIT(0))
#define PCR_GDMA_CLK_EN_M  (PCR_GDMA_CLK_EN_V << PCR_GDMA_CLK_EN_S)
#define PCR_GDMA_CLK_EN_V  0x00000001U
#define PCR_GDMA_CLK_EN_S  0
/** PCR_GDMA_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset gdma module
 */
#define PCR_GDMA_RST_EN    (BIT(1))
#define PCR_GDMA_RST_EN_M  (PCR_GDMA_RST_EN_V << PCR_GDMA_RST_EN_S)
#define PCR_GDMA_RST_EN_V  0x00000001U
#define PCR_GDMA_RST_EN_S  1

/** PCR_SPI2_CONF_REG register
 *  SPI2 configuration register
 */
#define PCR_SPI2_CONF_REG (DR_REG_PCR_BASE + 0x94)
/** PCR_SPI2_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable spi2 apb clock
 */
#define PCR_SPI2_CLK_EN    (BIT(0))
#define PCR_SPI2_CLK_EN_M  (PCR_SPI2_CLK_EN_V << PCR_SPI2_CLK_EN_S)
#define PCR_SPI2_CLK_EN_V  0x00000001U
#define PCR_SPI2_CLK_EN_S  0
/** PCR_SPI2_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset spi2 module
 */
#define PCR_SPI2_RST_EN    (BIT(1))
#define PCR_SPI2_RST_EN_M  (PCR_SPI2_RST_EN_V << PCR_SPI2_RST_EN_S)
#define PCR_SPI2_RST_EN_V  0x00000001U
#define PCR_SPI2_RST_EN_S  1
/** PCR_SPI2_READY : RO; bitpos: [2]; default: 1;
 *  Query this field after reset spi2 module
 */
#define PCR_SPI2_READY    (BIT(2))
#define PCR_SPI2_READY_M  (PCR_SPI2_READY_V << PCR_SPI2_READY_S)
#define PCR_SPI2_READY_V  0x00000001U
#define PCR_SPI2_READY_S  2

/** PCR_SPI2_CLKM_CONF_REG register
 *  SPI2_CLKM configuration register
 */
#define PCR_SPI2_CLKM_CONF_REG (DR_REG_PCR_BASE + 0x98)
/** PCR_SPI2_CLKM_DIV_NUM : R/W; bitpos: [19:12]; default: 0;
 *  The integral part of the frequency divider factor of the spi2_mst clock.
 */
#define PCR_SPI2_CLKM_DIV_NUM    0x000000FFU
#define PCR_SPI2_CLKM_DIV_NUM_M  (PCR_SPI2_CLKM_DIV_NUM_V << PCR_SPI2_CLKM_DIV_NUM_S)
#define PCR_SPI2_CLKM_DIV_NUM_V  0x000000FFU
#define PCR_SPI2_CLKM_DIV_NUM_S  12
/** PCR_SPI2_CLKM_SEL : R/W; bitpos: [21:20]; default: 0;
 *  Configures the clock source of SPI2.
 *  0 (default): XTAL_CLK
 *  1: PLL_F160M_CLK
 *  2: RC_FAST_CLK
 */
#define PCR_SPI2_CLKM_SEL    0x00000003U
#define PCR_SPI2_CLKM_SEL_M  (PCR_SPI2_CLKM_SEL_V << PCR_SPI2_CLKM_SEL_S)
#define PCR_SPI2_CLKM_SEL_V  0x00000003U
#define PCR_SPI2_CLKM_SEL_S  20
/** PCR_SPI2_CLKM_EN : R/W; bitpos: [22]; default: 1;
 *  Set 1 to enable spi2 function clock
 */
#define PCR_SPI2_CLKM_EN    (BIT(22))
#define PCR_SPI2_CLKM_EN_M  (PCR_SPI2_CLKM_EN_V << PCR_SPI2_CLKM_EN_S)
#define PCR_SPI2_CLKM_EN_V  0x00000001U
#define PCR_SPI2_CLKM_EN_S  22

/** PCR_SHA_CONF_REG register
 *  SHA configuration register
 */
#define PCR_SHA_CONF_REG (DR_REG_PCR_BASE + 0xa0)
/** PCR_SHA_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable sha clock
 */
#define PCR_SHA_CLK_EN    (BIT(0))
#define PCR_SHA_CLK_EN_M  (PCR_SHA_CLK_EN_V << PCR_SHA_CLK_EN_S)
#define PCR_SHA_CLK_EN_V  0x00000001U
#define PCR_SHA_CLK_EN_S  0
/** PCR_SHA_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset sha module
 */
#define PCR_SHA_RST_EN    (BIT(1))
#define PCR_SHA_RST_EN_M  (PCR_SHA_RST_EN_V << PCR_SHA_RST_EN_S)
#define PCR_SHA_RST_EN_V  0x00000001U
#define PCR_SHA_RST_EN_S  1
/** PCR_SHA_READY : RO; bitpos: [2]; default: 1;
 *  Query this field after reset sha module
 */
#define PCR_SHA_READY    (BIT(2))
#define PCR_SHA_READY_M  (PCR_SHA_READY_V << PCR_SHA_READY_S)
#define PCR_SHA_READY_V  0x00000001U
#define PCR_SHA_READY_S  2

/** PCR_ECC_CONF_REG register
 *  ECC configuration register
 */
#define PCR_ECC_CONF_REG (DR_REG_PCR_BASE + 0xac)
/** PCR_ECC_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable ecc clock
 */
#define PCR_ECC_CLK_EN    (BIT(0))
#define PCR_ECC_CLK_EN_M  (PCR_ECC_CLK_EN_V << PCR_ECC_CLK_EN_S)
#define PCR_ECC_CLK_EN_V  0x00000001U
#define PCR_ECC_CLK_EN_S  0
/** PCR_ECC_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset ecc module
 */
#define PCR_ECC_RST_EN    (BIT(1))
#define PCR_ECC_RST_EN_M  (PCR_ECC_RST_EN_V << PCR_ECC_RST_EN_S)
#define PCR_ECC_RST_EN_V  0x00000001U
#define PCR_ECC_RST_EN_S  1
/** PCR_ECC_READY : RO; bitpos: [2]; default: 1;
 *  Query this field after reset ecc module
 */
#define PCR_ECC_READY    (BIT(2))
#define PCR_ECC_READY_M  (PCR_ECC_READY_V << PCR_ECC_READY_S)
#define PCR_ECC_READY_V  0x00000001U
#define PCR_ECC_READY_S  2

/** PCR_ECC_PD_CTRL_REG register
 *  ECC power control register
 */
#define PCR_ECC_PD_CTRL_REG (DR_REG_PCR_BASE + 0xb0)
/** PCR_ECC_MEM_PD : R/W; bitpos: [0]; default: 0;
 *  Set this bit to power down ecc internal memory.
 */
#define PCR_ECC_MEM_PD    (BIT(0))
#define PCR_ECC_MEM_PD_M  (PCR_ECC_MEM_PD_V << PCR_ECC_MEM_PD_S)
#define PCR_ECC_MEM_PD_V  0x00000001U
#define PCR_ECC_MEM_PD_S  0
/** PCR_ECC_MEM_FORCE_PU : R/W; bitpos: [1]; default: 1;
 *  Set this bit to force power up ecc internal memory
 */
#define PCR_ECC_MEM_FORCE_PU    (BIT(1))
#define PCR_ECC_MEM_FORCE_PU_M  (PCR_ECC_MEM_FORCE_PU_V << PCR_ECC_MEM_FORCE_PU_S)
#define PCR_ECC_MEM_FORCE_PU_V  0x00000001U
#define PCR_ECC_MEM_FORCE_PU_S  1
/** PCR_ECC_MEM_FORCE_PD : R/W; bitpos: [2]; default: 0;
 *  Set this bit to force power down ecc internal memory.
 */
#define PCR_ECC_MEM_FORCE_PD    (BIT(2))
#define PCR_ECC_MEM_FORCE_PD_M  (PCR_ECC_MEM_FORCE_PD_V << PCR_ECC_MEM_FORCE_PD_S)
#define PCR_ECC_MEM_FORCE_PD_V  0x00000001U
#define PCR_ECC_MEM_FORCE_PD_S  2

/** PCR_ECDSA_CONF_REG register
 *  ECDSA configuration register
 */
#define PCR_ECDSA_CONF_REG (DR_REG_PCR_BASE + 0xbc)
/** PCR_ECDSA_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable ecdsa clock
 */
#define PCR_ECDSA_CLK_EN    (BIT(0))
#define PCR_ECDSA_CLK_EN_M  (PCR_ECDSA_CLK_EN_V << PCR_ECDSA_CLK_EN_S)
#define PCR_ECDSA_CLK_EN_V  0x00000001U
#define PCR_ECDSA_CLK_EN_S  0
/** PCR_ECDSA_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset ecdsa module
 */
#define PCR_ECDSA_RST_EN    (BIT(1))
#define PCR_ECDSA_RST_EN_M  (PCR_ECDSA_RST_EN_V << PCR_ECDSA_RST_EN_S)
#define PCR_ECDSA_RST_EN_V  0x00000001U
#define PCR_ECDSA_RST_EN_S  1
/** PCR_ECDSA_READY : RO; bitpos: [2]; default: 1;
 *  Query this field after reset ecdsa module
 */
#define PCR_ECDSA_READY    (BIT(2))
#define PCR_ECDSA_READY_M  (PCR_ECDSA_READY_V << PCR_ECDSA_READY_S)
#define PCR_ECDSA_READY_V  0x00000001U
#define PCR_ECDSA_READY_S  2

