espressif/esp-idf/components/soc/esp32c61/register/soc/pcr_reg.h
/** PCR_IOMUX_CONF_REG register
 *  IOMUX configuration register
 */
#define PCR_IOMUX_CONF_REG (DR_REG_PCR_BASE + 0xc0)
/** PCR_IOMUX_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable iomux apb clock
 */
#define PCR_IOMUX_CLK_EN    (BIT(0))
#define PCR_IOMUX_CLK_EN_M  (PCR_IOMUX_CLK_EN_V << PCR_IOMUX_CLK_EN_S)
#define PCR_IOMUX_CLK_EN_V  0x00000001U
#define PCR_IOMUX_CLK_EN_S  0
/** PCR_IOMUX_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset iomux module
 */
#define PCR_IOMUX_RST_EN    (BIT(1))
#define PCR_IOMUX_RST_EN_M  (PCR_IOMUX_RST_EN_V << PCR_IOMUX_RST_EN_S)
#define PCR_IOMUX_RST_EN_V  0x00000001U
#define PCR_IOMUX_RST_EN_S  1

/** PCR_IOMUX_CLK_CONF_REG register
 *  IOMUX_CLK configuration register
 */
#define PCR_IOMUX_CLK_CONF_REG (DR_REG_PCR_BASE + 0xc4)
/** PCR_IOMUX_FUNC_CLK_SEL : R/W; bitpos: [21:20]; default: 0;
 *  Configures the clock source of IO MUX.
 *  0 (default): XTAL_CLK
 *  1: RC_FAST_CLK
 *  2: PLL_F80M_CLK
 */
#define PCR_IOMUX_FUNC_CLK_SEL    0x00000003U
#define PCR_IOMUX_FUNC_CLK_SEL_M  (PCR_IOMUX_FUNC_CLK_SEL_V << PCR_IOMUX_FUNC_CLK_SEL_S)
#define PCR_IOMUX_FUNC_CLK_SEL_V  0x00000003U
#define PCR_IOMUX_FUNC_CLK_SEL_S  20
/** PCR_IOMUX_FUNC_CLK_EN : R/W; bitpos: [22]; default: 1;
 *  Set 1 to enable iomux function clock
 */
#define PCR_IOMUX_FUNC_CLK_EN    (BIT(22))
#define PCR_IOMUX_FUNC_CLK_EN_M  (PCR_IOMUX_FUNC_CLK_EN_V << PCR_IOMUX_FUNC_CLK_EN_S)
#define PCR_IOMUX_FUNC_CLK_EN_V  0x00000001U
#define PCR_IOMUX_FUNC_CLK_EN_S  22

/** PCR_TCM_MEM_MONITOR_CONF_REG register
 *  TCM_MEM_MONITOR configuration register
 */
#define PCR_TCM_MEM_MONITOR_CONF_REG (DR_REG_PCR_BASE + 0xc8)
/** PCR_TCM_MEM_MONITOR_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable tcm_mem_monitor clock
 */
#define PCR_TCM_MEM_MONITOR_CLK_EN    (BIT(0))
#define PCR_TCM_MEM_MONITOR_CLK_EN_M  (PCR_TCM_MEM_MONITOR_CLK_EN_V << PCR_TCM_MEM_MONITOR_CLK_EN_S)
#define PCR_TCM_MEM_MONITOR_CLK_EN_V  0x00000001U
#define PCR_TCM_MEM_MONITOR_CLK_EN_S  0
/** PCR_TCM_MEM_MONITOR_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset tcm_mem_monitor module
 */
#define PCR_TCM_MEM_MONITOR_RST_EN    (BIT(1))
#define PCR_TCM_MEM_MONITOR_RST_EN_M  (PCR_TCM_MEM_MONITOR_RST_EN_V << PCR_TCM_MEM_MONITOR_RST_EN_S)
#define PCR_TCM_MEM_MONITOR_RST_EN_V  0x00000001U
#define PCR_TCM_MEM_MONITOR_RST_EN_S  1
/** PCR_TCM_MEM_MONITOR_READY : RO; bitpos: [2]; default: 1;
 *  Query this field after reset tcm_mem_monitor module
 */
#define PCR_TCM_MEM_MONITOR_READY    (BIT(2))
#define PCR_TCM_MEM_MONITOR_READY_M  (PCR_TCM_MEM_MONITOR_READY_V << PCR_TCM_MEM_MONITOR_READY_S)
#define PCR_TCM_MEM_MONITOR_READY_V  0x00000001U
#define PCR_TCM_MEM_MONITOR_READY_S  2

/** PCR_PSRAM_MEM_MONITOR_CONF_REG register
 *  PSRAM_MEM_MONITOR configuration register
 */
#define PCR_PSRAM_MEM_MONITOR_CONF_REG (DR_REG_PCR_BASE + 0xcc)
/** PCR_PSRAM_MEM_MONITOR_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable psram_mem_monitor clock
 */
#define PCR_PSRAM_MEM_MONITOR_CLK_EN    (BIT(0))
#define PCR_PSRAM_MEM_MONITOR_CLK_EN_M  (PCR_PSRAM_MEM_MONITOR_CLK_EN_V << PCR_PSRAM_MEM_MONITOR_CLK_EN_S)
#define PCR_PSRAM_MEM_MONITOR_CLK_EN_V  0x00000001U
#define PCR_PSRAM_MEM_MONITOR_CLK_EN_S  0
/** PCR_PSRAM_MEM_MONITOR_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset psram_mem_monitor module
 */
#define PCR_PSRAM_MEM_MONITOR_RST_EN    (BIT(1))
#define PCR_PSRAM_MEM_MONITOR_RST_EN_M  (PCR_PSRAM_MEM_MONITOR_RST_EN_V << PCR_PSRAM_MEM_MONITOR_RST_EN_S)
#define PCR_PSRAM_MEM_MONITOR_RST_EN_V  0x00000001U
#define PCR_PSRAM_MEM_MONITOR_RST_EN_S  1
/** PCR_PSRAM_MEM_MONITOR_READY : RO; bitpos: [2]; default: 1;
 *  Query this field after reset psram_mem_monitor module
 */
#define PCR_PSRAM_MEM_MONITOR_READY    (BIT(2))
#define PCR_PSRAM_MEM_MONITOR_READY_M  (PCR_PSRAM_MEM_MONITOR_READY_V << PCR_PSRAM_MEM_MONITOR_READY_S)
#define PCR_PSRAM_MEM_MONITOR_READY_V  0x00000001U
#define PCR_PSRAM_MEM_MONITOR_READY_S  2

/** PCR_TRACE_CONF_REG register
 *  TRACE configuration register
 */
#define PCR_TRACE_CONF_REG (DR_REG_PCR_BASE + 0xd0)
/** PCR_TRACE_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable trace clock
 */
#define PCR_TRACE_CLK_EN    (BIT(0))
#define PCR_TRACE_CLK_EN_M  (PCR_TRACE_CLK_EN_V << PCR_TRACE_CLK_EN_S)
#define PCR_TRACE_CLK_EN_V  0x00000001U
#define PCR_TRACE_CLK_EN_S  0
/** PCR_TRACE_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset trace module
 */
#define PCR_TRACE_RST_EN    (BIT(1))
#define PCR_TRACE_RST_EN_M  (PCR_TRACE_RST_EN_V << PCR_TRACE_RST_EN_S)
#define PCR_TRACE_RST_EN_V  0x00000001U
#define PCR_TRACE_RST_EN_S  1

/** PCR_ASSIST_CONF_REG register
 *  ASSIST configuration register
 */
#define PCR_ASSIST_CONF_REG (DR_REG_PCR_BASE + 0xd4)
/** PCR_ASSIST_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable assist clock
 */
#define PCR_ASSIST_CLK_EN    (BIT(0))
#define PCR_ASSIST_CLK_EN_M  (PCR_ASSIST_CLK_EN_V << PCR_ASSIST_CLK_EN_S)
#define PCR_ASSIST_CLK_EN_V  0x00000001U
#define PCR_ASSIST_CLK_EN_S  0
/** PCR_ASSIST_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset assist module
 */
#define PCR_ASSIST_RST_EN    (BIT(1))
#define PCR_ASSIST_RST_EN_M  (PCR_ASSIST_RST_EN_V << PCR_ASSIST_RST_EN_S)
#define PCR_ASSIST_RST_EN_V  0x00000001U
#define PCR_ASSIST_RST_EN_S  1

/** PCR_CACHE_CONF_REG register
 *  CACHE configuration register
 */
#define PCR_CACHE_CONF_REG (DR_REG_PCR_BASE + 0xd8)
/** PCR_CACHE_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable cache clock
 */
#define PCR_CACHE_CLK_EN    (BIT(0))
#define PCR_CACHE_CLK_EN_M  (PCR_CACHE_CLK_EN_V << PCR_CACHE_CLK_EN_S)
#define PCR_CACHE_CLK_EN_V  0x00000001U
#define PCR_CACHE_CLK_EN_S  0
/** PCR_CACHE_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset cache module
 */
#define PCR_CACHE_RST_EN    (BIT(1))
#define PCR_CACHE_RST_EN_M  (PCR_CACHE_RST_EN_V << PCR_CACHE_RST_EN_S)
#define PCR_CACHE_RST_EN_V  0x00000001U
#define PCR_CACHE_RST_EN_S  1

/** PCR_CACHE_PD_CTRL_REG register
 *  CACHE power control register
 */
#define PCR_CACHE_PD_CTRL_REG (DR_REG_PCR_BASE + 0xdc)
/** PCR_CACHE_MEM_FORCE_PU : R/W; bitpos: [1]; default: 1;
 *  Set this bit to force power down CACHE memory.
 */
#define PCR_CACHE_MEM_FORCE_PU    (BIT(1))
#define PCR_CACHE_MEM_FORCE_PU_M  (PCR_CACHE_MEM_FORCE_PU_V << PCR_CACHE_MEM_FORCE_PU_S)
#define PCR_CACHE_MEM_FORCE_PU_V  0x00000001U
#define PCR_CACHE_MEM_FORCE_PU_S  1
/** PCR_CACHE_MEM_FORCE_PD : R/W; bitpos: [2]; default: 0;
 *  Set this bit to force power up CACHE memory.
 */
#define PCR_CACHE_MEM_FORCE_PD    (BIT(2))
#define PCR_CACHE_MEM_FORCE_PD_M  (PCR_CACHE_MEM_FORCE_PD_V << PCR_CACHE_MEM_FORCE_PD_S)
#define PCR_CACHE_MEM_FORCE_PD_V  0x00000001U
#define PCR_CACHE_MEM_FORCE_PD_S  2

/** PCR_MODEM_CONF_REG register
 *  MODEM_APB configuration register
 */
#define PCR_MODEM_CONF_REG (DR_REG_PCR_BASE + 0xe0)
/** PCR_MODEM_APB_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  This field indicates if modem_apb clock is enable. 0: disable, 1: enable(default).
 */
#define PCR_MODEM_APB_CLK_EN    (BIT(0))
#define PCR_MODEM_APB_CLK_EN_M  (PCR_MODEM_APB_CLK_EN_V << PCR_MODEM_APB_CLK_EN_S)
#define PCR_MODEM_APB_CLK_EN_V  0x00000001U
#define PCR_MODEM_APB_CLK_EN_S  0
/** PCR_MODEM_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set this file as 1 to reset modem-subsystem.
 */
#define PCR_MODEM_RST_EN    (BIT(1))
#define PCR_MODEM_RST_EN_M  (PCR_MODEM_RST_EN_V << PCR_MODEM_RST_EN_S)
#define PCR_MODEM_RST_EN_V  0x00000001U
#define PCR_MODEM_RST_EN_S  1
/** PCR_MODEM_CLK_EN : R/W; bitpos: [2]; default: 1;
 *  This field indicates if modem source clock is enable. 0: disable, 1:
 *  enable(default).
 */
#define PCR_MODEM_CLK_EN    (BIT(2))
#define PCR_MODEM_CLK_EN_M  (PCR_MODEM_CLK_EN_V << PCR_MODEM_CLK_EN_S)
#define PCR_MODEM_CLK_EN_V  0x00000001U
#define PCR_MODEM_CLK_EN_S  2

/** PCR_TIMEOUT_CONF_REG register
 *  TIMEOUT configuration register
 */
#define PCR_TIMEOUT_CONF_REG (DR_REG_PCR_BASE + 0xe4)
/** PCR_CPU_TIMEOUT_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset cpu_peri timeout module
 */
#define PCR_CPU_TIMEOUT_RST_EN    (BIT(1))
#define PCR_CPU_TIMEOUT_RST_EN_M  (PCR_CPU_TIMEOUT_RST_EN_V << PCR_CPU_TIMEOUT_RST_EN_S)
#define PCR_CPU_TIMEOUT_RST_EN_V  0x00000001U
#define PCR_CPU_TIMEOUT_RST_EN_S  1
/** PCR_HP_TIMEOUT_RST_EN : R/W; bitpos: [2]; default: 0;
 *  Set 1 to reset hp_peri timeout module and hp_modem timeout module
 */
#define PCR_HP_TIMEOUT_RST_EN    (BIT(2))
#define PCR_HP_TIMEOUT_RST_EN_M  (PCR_HP_TIMEOUT_RST_EN_V << PCR_HP_TIMEOUT_RST_EN_S)
#define PCR_HP_TIMEOUT_RST_EN_V  0x00000001U
#define PCR_HP_TIMEOUT_RST_EN_S  2

