espressif/esp-idf/components/soc/esp32c61/register/soc/pcr_reg.h
/** PCR_CTRL_CLK_OUT_EN_REG register
 *  CLK_OUT_EN configuration register
 */
#define PCR_CTRL_CLK_OUT_EN_REG (DR_REG_PCR_BASE + 0x104)
/** PCR_CLK20_OEN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable 20m clock
 */
#define PCR_CLK20_OEN    (BIT(0))
#define PCR_CLK20_OEN_M  (PCR_CLK20_OEN_V << PCR_CLK20_OEN_S)
#define PCR_CLK20_OEN_V  0x00000001U
#define PCR_CLK20_OEN_S  0
/** PCR_CLK22_OEN : R/W; bitpos: [1]; default: 1;
 *  Set 1 to enable 22m clock
 */
#define PCR_CLK22_OEN    (BIT(1))
#define PCR_CLK22_OEN_M  (PCR_CLK22_OEN_V << PCR_CLK22_OEN_S)
#define PCR_CLK22_OEN_V  0x00000001U
#define PCR_CLK22_OEN_S  1
/** PCR_CLK44_OEN : R/W; bitpos: [2]; default: 1;
 *  Set 1 to enable 44m clock
 */
#define PCR_CLK44_OEN    (BIT(2))
#define PCR_CLK44_OEN_M  (PCR_CLK44_OEN_V << PCR_CLK44_OEN_S)
#define PCR_CLK44_OEN_V  0x00000001U
#define PCR_CLK44_OEN_S  2
/** PCR_CLK_BB_OEN : R/W; bitpos: [3]; default: 1;
 *  Set 1 to enable bb clock
 */
#define PCR_CLK_BB_OEN    (BIT(3))
#define PCR_CLK_BB_OEN_M  (PCR_CLK_BB_OEN_V << PCR_CLK_BB_OEN_S)
#define PCR_CLK_BB_OEN_V  0x00000001U
#define PCR_CLK_BB_OEN_S  3
/** PCR_CLK80_OEN : R/W; bitpos: [4]; default: 1;
 *  Set 1 to enable 80m clock
 */
#define PCR_CLK80_OEN    (BIT(4))
#define PCR_CLK80_OEN_M  (PCR_CLK80_OEN_V << PCR_CLK80_OEN_S)
#define PCR_CLK80_OEN_V  0x00000001U
#define PCR_CLK80_OEN_S  4
/** PCR_CLK160_OEN : R/W; bitpos: [5]; default: 1;
 *  Set 1 to enable 160m clock
 */
#define PCR_CLK160_OEN    (BIT(5))
#define PCR_CLK160_OEN_M  (PCR_CLK160_OEN_V << PCR_CLK160_OEN_S)
#define PCR_CLK160_OEN_V  0x00000001U
#define PCR_CLK160_OEN_S  5
/** PCR_CLK_320M_OEN : R/W; bitpos: [6]; default: 1;
 *  Set 1 to enable 320m clock
 */
#define PCR_CLK_320M_OEN    (BIT(6))
#define PCR_CLK_320M_OEN_M  (PCR_CLK_320M_OEN_V << PCR_CLK_320M_OEN_S)
#define PCR_CLK_320M_OEN_V  0x00000001U
#define PCR_CLK_320M_OEN_S  6
/** PCR_CLK_ADC_INF_OEN : R/W; bitpos: [7]; default: 1;
 *  Reserved
 */
#define PCR_CLK_ADC_INF_OEN    (BIT(7))
#define PCR_CLK_ADC_INF_OEN_M  (PCR_CLK_ADC_INF_OEN_V << PCR_CLK_ADC_INF_OEN_S)
#define PCR_CLK_ADC_INF_OEN_V  0x00000001U
#define PCR_CLK_ADC_INF_OEN_S  7
/** PCR_CLK_DAC_CPU_OEN : R/W; bitpos: [8]; default: 1;
 *  Reserved
 */
#define PCR_CLK_DAC_CPU_OEN    (BIT(8))
#define PCR_CLK_DAC_CPU_OEN_M  (PCR_CLK_DAC_CPU_OEN_V << PCR_CLK_DAC_CPU_OEN_S)
#define PCR_CLK_DAC_CPU_OEN_V  0x00000001U
#define PCR_CLK_DAC_CPU_OEN_S  8
/** PCR_CLK_XTAL_OEN : R/W; bitpos: [9]; default: 1;
 *  Set 1 to enable xtal clock
 */
#define PCR_CLK_XTAL_OEN    (BIT(9))
#define PCR_CLK_XTAL_OEN_M  (PCR_CLK_XTAL_OEN_V << PCR_CLK_XTAL_OEN_S)
#define PCR_CLK_XTAL_OEN_V  0x00000001U
#define PCR_CLK_XTAL_OEN_S  9

/** PCR_CTRL_32K_CONF_REG register
 *  32KHz clock configuration register
 */
#define PCR_CTRL_32K_CONF_REG (DR_REG_PCR_BASE + 0x10c)
/** PCR_32K_SEL : R/W; bitpos: [2:0]; default: 0;
 *  Configures the 32KHz clock for TIMER_GROUP.
 *  0 (default): RC32K_CLK
 *  1: XTAL32K_CLK
 *  2: OSC_SLOW_CLK
 *  3: RC_SLOW_CLK
 *  4: RC_FAST_CLK
 */
#define PCR_32K_SEL    0x00000007U
#define PCR_32K_SEL_M  (PCR_32K_SEL_V << PCR_32K_SEL_S)
#define PCR_32K_SEL_V  0x00000007U
#define PCR_32K_SEL_S  0
/** PCR_FOSC_TICK_NUM : R/W; bitpos: [15:8]; default: 7;
 *  When PCR_32K_SEL set as 4, This field PCR_FOSC_TICK_NUM is used to set the divider
 *  number of fosc.
 */
#define PCR_FOSC_TICK_NUM    0x000000FFU
#define PCR_FOSC_TICK_NUM_M  (PCR_FOSC_TICK_NUM_V << PCR_FOSC_TICK_NUM_S)
#define PCR_FOSC_TICK_NUM_V  0x000000FFU
#define PCR_FOSC_TICK_NUM_S  8

/** PCR_SRAM_POWER_CONF_0_REG register
 *  HP SRAM/ROM configuration register
 */
#define PCR_SRAM_POWER_CONF_0_REG (DR_REG_PCR_BASE + 0x110)
/** PCR_ROM_FORCE_PU : R/W; bitpos: [1:0]; default: 3;
 *  Set this bit to force power up ROM
 */
#define PCR_ROM_FORCE_PU    0x00000003U
#define PCR_ROM_FORCE_PU_M  (PCR_ROM_FORCE_PU_V << PCR_ROM_FORCE_PU_S)
#define PCR_ROM_FORCE_PU_V  0x00000003U
#define PCR_ROM_FORCE_PU_S  0
/** PCR_ROM_FORCE_PD : R/W; bitpos: [3:2]; default: 0;
 *  Set this bit to force power down ROM.
 */
#define PCR_ROM_FORCE_PD    0x00000003U
#define PCR_ROM_FORCE_PD_M  (PCR_ROM_FORCE_PD_V << PCR_ROM_FORCE_PD_S)
#define PCR_ROM_FORCE_PD_V  0x00000003U
#define PCR_ROM_FORCE_PD_S  2
/** PCR_ROM_CLKGATE_FORCE_ON : R/W; bitpos: [5:4]; default: 0;
 *  1: Force to open the clock and bypass the gate-clock when accessing the ROM. 0: A
 *  gate-clock will be used when accessing the ROM.
 */
#define PCR_ROM_CLKGATE_FORCE_ON    0x00000003U
#define PCR_ROM_CLKGATE_FORCE_ON_M  (PCR_ROM_CLKGATE_FORCE_ON_V << PCR_ROM_CLKGATE_FORCE_ON_S)
#define PCR_ROM_CLKGATE_FORCE_ON_V  0x00000003U
#define PCR_ROM_CLKGATE_FORCE_ON_S  4

/** PCR_SRAM_POWER_CONF_1_REG register
 *  HP SRAM/ROM configuration register
 */
#define PCR_SRAM_POWER_CONF_1_REG (DR_REG_PCR_BASE + 0x114)
/** PCR_SRAM_FORCE_PU : R/W; bitpos: [4:0]; default: 31;
 *  Set this bit to force power up SRAM
 */
#define PCR_SRAM_FORCE_PU    0x0000001FU
#define PCR_SRAM_FORCE_PU_M  (PCR_SRAM_FORCE_PU_V << PCR_SRAM_FORCE_PU_S)
#define PCR_SRAM_FORCE_PU_V  0x0000001FU
#define PCR_SRAM_FORCE_PU_S  0
/** PCR_SRAM_FORCE_PD : R/W; bitpos: [14:10]; default: 0;
 *  Set this bit to force power down SRAM.
 */
#define PCR_SRAM_FORCE_PD    0x0000001FU
#define PCR_SRAM_FORCE_PD_M  (PCR_SRAM_FORCE_PD_V << PCR_SRAM_FORCE_PD_S)
#define PCR_SRAM_FORCE_PD_V  0x0000001FU
#define PCR_SRAM_FORCE_PD_S  10
/** PCR_SRAM_CLKGATE_FORCE_ON : R/W; bitpos: [24:20]; default: 0;
 *  1: Force to open the clock and bypass the gate-clock when accessing the SRAM. 0: A
 *  gate-clock will be used when accessing the SRAM.
 */
#define PCR_SRAM_CLKGATE_FORCE_ON    0x0000001FU
#define PCR_SRAM_CLKGATE_FORCE_ON_M  (PCR_SRAM_CLKGATE_FORCE_ON_V << PCR_SRAM_CLKGATE_FORCE_ON_S)
#define PCR_SRAM_CLKGATE_FORCE_ON_V  0x0000001FU
#define PCR_SRAM_CLKGATE_FORCE_ON_S  20

/** PCR_SEC_CONF_REG register
 *  Clock source configuration register for External Memory Encryption and Decryption
 */
#define PCR_SEC_CONF_REG (DR_REG_PCR_BASE + 0x118)
/** PCR_SEC_CLK_SEL : R/W; bitpos: [1:0]; default: 0;
 *  Configures the clock source for the External Memory Encryption and Decryption
 *  module.
 *  0(default): XTAL_CLK
 *  1 RC_FAST_CLK
 *  2: PLL_F480M_CLK
 */
#define PCR_SEC_CLK_SEL    0x00000003U
#define PCR_SEC_CLK_SEL_M  (PCR_SEC_CLK_SEL_V << PCR_SEC_CLK_SEL_S)
#define PCR_SEC_CLK_SEL_V  0x00000003U
#define PCR_SEC_CLK_SEL_S  0
/** PCR_SEC_RST_EN : R/W; bitpos: [2]; default: 0;
 *  Set 1 to reset sec module
 */
#define PCR_SEC_RST_EN    (BIT(2))
#define PCR_SEC_RST_EN_M  (PCR_SEC_RST_EN_V << PCR_SEC_RST_EN_S)
#define PCR_SEC_RST_EN_V  0x00000001U
#define PCR_SEC_RST_EN_S  2

/** PCR_BUS_CLK_UPDATE_REG register
 *  Configuration register for applying updated high-performance system clock sources
 */
#define PCR_BUS_CLK_UPDATE_REG (DR_REG_PCR_BASE + 0x120)
/** PCR_BUS_CLOCK_UPDATE : R/W/WTC; bitpos: [0]; default: 0;
 *  Configures whether or not to update configurations for CPU_CLK division, AHB_CLK
 *  division and HP_ROOT_CLK clock source selection.
 *  0: Not update configurations
 *  1: Update configurations
 *  This bit is automatically cleared when configurations have been updated.
 */
#define PCR_BUS_CLOCK_UPDATE    (BIT(0))
#define PCR_BUS_CLOCK_UPDATE_M  (PCR_BUS_CLOCK_UPDATE_V << PCR_BUS_CLOCK_UPDATE_S)
#define PCR_BUS_CLOCK_UPDATE_V  0x00000001U
#define PCR_BUS_CLOCK_UPDATE_S  0

