espressif/esp-idf/components/soc/esp32c61/register/soc/pcr_reg.h
/** PCR_SAR_CLK_DIV_REG register
 *  SAR ADC clock divisor configuration register
 */
#define PCR_SAR_CLK_DIV_REG (DR_REG_PCR_BASE + 0x124)
/** PCR_SAR2_CLK_DIV_NUM : R/W; bitpos: [7:0]; default: 4;
 *  Configures the divisor for SAR ADC 2  clock to generate ADC analog control signals.
 */
#define PCR_SAR2_CLK_DIV_NUM    0x000000FFU
#define PCR_SAR2_CLK_DIV_NUM_M  (PCR_SAR2_CLK_DIV_NUM_V << PCR_SAR2_CLK_DIV_NUM_S)
#define PCR_SAR2_CLK_DIV_NUM_V  0x000000FFU
#define PCR_SAR2_CLK_DIV_NUM_S  0
/** PCR_SAR1_CLK_DIV_NUM : R/W; bitpos: [15:8]; default: 4;
 *  Configures the divisor for SAR ADC 1  clock to generate ADC analog control signals.
 */
#define PCR_SAR1_CLK_DIV_NUM    0x000000FFU
#define PCR_SAR1_CLK_DIV_NUM_M  (PCR_SAR1_CLK_DIV_NUM_V << PCR_SAR1_CLK_DIV_NUM_S)
#define PCR_SAR1_CLK_DIV_NUM_V  0x000000FFU
#define PCR_SAR1_CLK_DIV_NUM_S  8

/** PCR_TIMERGROUP_WDT_CONF_REG register
 *  TIMERGROUP_WDT configuration register
 */
#define PCR_TIMERGROUP_WDT_CONF_REG (DR_REG_PCR_BASE + 0x12c)
/** PCR_TG0_WDT_RST_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to reset timer_group0 wdt module
 */
#define PCR_TG0_WDT_RST_EN    (BIT(0))
#define PCR_TG0_WDT_RST_EN_M  (PCR_TG0_WDT_RST_EN_V << PCR_TG0_WDT_RST_EN_S)
#define PCR_TG0_WDT_RST_EN_V  0x00000001U
#define PCR_TG0_WDT_RST_EN_S  0
/** PCR_TG1_WDT_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset timer_group1 wdt module
 */
#define PCR_TG1_WDT_RST_EN    (BIT(1))
#define PCR_TG1_WDT_RST_EN_M  (PCR_TG1_WDT_RST_EN_V << PCR_TG1_WDT_RST_EN_S)
#define PCR_TG1_WDT_RST_EN_V  0x00000001U
#define PCR_TG1_WDT_RST_EN_S  1

/** PCR_TIMERGROUP_XTAL_CONF_REG register
 *  TIMERGROUP1 configuration register
 */
#define PCR_TIMERGROUP_XTAL_CONF_REG (DR_REG_PCR_BASE + 0x130)
/** PCR_TG0_XTAL_RST_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to reset timer_group0 xtal clock domain
 */
#define PCR_TG0_XTAL_RST_EN    (BIT(0))
#define PCR_TG0_XTAL_RST_EN_M  (PCR_TG0_XTAL_RST_EN_V << PCR_TG0_XTAL_RST_EN_S)
#define PCR_TG0_XTAL_RST_EN_V  0x00000001U
#define PCR_TG0_XTAL_RST_EN_S  0
/** PCR_TG1_XTAL_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset timer_group1 xtal clock domain
 */
#define PCR_TG1_XTAL_RST_EN    (BIT(1))
#define PCR_TG1_XTAL_RST_EN_M  (PCR_TG1_XTAL_RST_EN_V << PCR_TG1_XTAL_RST_EN_S)
#define PCR_TG1_XTAL_RST_EN_V  0x00000001U
#define PCR_TG1_XTAL_RST_EN_S  1
/** PCR_TG0_XTAL_CLK_EN : R/W; bitpos: [2]; default: 1;
 *  Set 1 to enable tg0 xtal clock
 */
#define PCR_TG0_XTAL_CLK_EN    (BIT(2))
#define PCR_TG0_XTAL_CLK_EN_M  (PCR_TG0_XTAL_CLK_EN_V << PCR_TG0_XTAL_CLK_EN_S)
#define PCR_TG0_XTAL_CLK_EN_V  0x00000001U
#define PCR_TG0_XTAL_CLK_EN_S  2

/** PCR_RESET_EVENT_BYPASS_REG register
 *  reset event bypass backdoor configuration register
 */
#define PCR_RESET_EVENT_BYPASS_REG (DR_REG_PCR_BASE + 0x134)
/** PCR_RESET_EVENT_BYPASS_APM : R/W; bitpos: [0]; default: 0;
 *  This field is used to control reset event relationship for
 *  tee_reg/apm_reg/hp_system_reg. 1: tee_reg/apm_reg/hp_system_reg will only be reset
 *  by power-reset. some reset event will be bypass. 0: tee_reg/apm_reg/hp_system_reg
 *  will not only be reset by power-reset, but also some reset event.
 */
#define PCR_RESET_EVENT_BYPASS_APM    (BIT(0))
#define PCR_RESET_EVENT_BYPASS_APM_M  (PCR_RESET_EVENT_BYPASS_APM_V << PCR_RESET_EVENT_BYPASS_APM_S)
#define PCR_RESET_EVENT_BYPASS_APM_V  0x00000001U
#define PCR_RESET_EVENT_BYPASS_APM_S  0
/** PCR_RESET_EVENT_BYPASS : R/W; bitpos: [1]; default: 1;
 *  This field is used to control reset event relationship for system-bus. 1: system
 *  bus (including arbiter/router) will only be reset by power-reset. some reset event
 *  will be bypass. 0: system bus (including arbiter/router) will not only be reset by
 *  power-reset, but also some reset event.
 */
#define PCR_RESET_EVENT_BYPASS    (BIT(1))
#define PCR_RESET_EVENT_BYPASS_M  (PCR_RESET_EVENT_BYPASS_V << PCR_RESET_EVENT_BYPASS_S)
#define PCR_RESET_EVENT_BYPASS_V  0x00000001U
#define PCR_RESET_EVENT_BYPASS_S  1

/** PCR_REGDMA_CONF_REG register
 *  REGDMA configuration register
 */
#define PCR_REGDMA_CONF_REG (DR_REG_PCR_BASE + 0x138)
/** PCR_REGDMA_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to enable regdma clock
 */
#define PCR_REGDMA_CLK_EN    (BIT(0))
#define PCR_REGDMA_CLK_EN_M  (PCR_REGDMA_CLK_EN_V << PCR_REGDMA_CLK_EN_S)
#define PCR_REGDMA_CLK_EN_V  0x00000001U
#define PCR_REGDMA_CLK_EN_S  0
/** PCR_REGDMA_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset regdma module
 */
#define PCR_REGDMA_RST_EN    (BIT(1))
#define PCR_REGDMA_RST_EN_M  (PCR_REGDMA_RST_EN_V << PCR_REGDMA_RST_EN_S)
#define PCR_REGDMA_RST_EN_V  0x00000001U
#define PCR_REGDMA_RST_EN_S  1

/** PCR_ETM_CONF_REG register
 *  ETM configuration register
 */
#define PCR_ETM_CONF_REG (DR_REG_PCR_BASE + 0x13c)
/** PCR_ETM_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable etm clock
 */
#define PCR_ETM_CLK_EN    (BIT(0))
#define PCR_ETM_CLK_EN_M  (PCR_ETM_CLK_EN_V << PCR_ETM_CLK_EN_S)
#define PCR_ETM_CLK_EN_V  0x00000001U
#define PCR_ETM_CLK_EN_S  0
/** PCR_ETM_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset etm module
 */
#define PCR_ETM_RST_EN    (BIT(1))
#define PCR_ETM_RST_EN_M  (PCR_ETM_RST_EN_V << PCR_ETM_RST_EN_S)
#define PCR_ETM_RST_EN_V  0x00000001U
#define PCR_ETM_RST_EN_S  1
/** PCR_ETM_READY : RO; bitpos: [2]; default: 1;
 *  Query this field after reset etm module
 */
#define PCR_ETM_READY    (BIT(2))
#define PCR_ETM_READY_M  (PCR_ETM_READY_V << PCR_ETM_READY_S)
#define PCR_ETM_READY_V  0x00000001U
#define PCR_ETM_READY_S  2

/** PCR_SDIO_SLAVE_CONF_REG register
 *  SDIO_SLAVE configuration register
 */
#define PCR_SDIO_SLAVE_CONF_REG (DR_REG_PCR_BASE + 0x158)
/** PCR_SDIO_SLAVE_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable sdio_slave clock
 */
#define PCR_SDIO_SLAVE_CLK_EN    (BIT(0))
#define PCR_SDIO_SLAVE_CLK_EN_M  (PCR_SDIO_SLAVE_CLK_EN_V << PCR_SDIO_SLAVE_CLK_EN_S)
#define PCR_SDIO_SLAVE_CLK_EN_V  0x00000001U
#define PCR_SDIO_SLAVE_CLK_EN_S  0
/** PCR_SDIO_SLAVE_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset sdio_slave module
 */
#define PCR_SDIO_SLAVE_RST_EN    (BIT(1))
#define PCR_SDIO_SLAVE_RST_EN_M  (PCR_SDIO_SLAVE_RST_EN_V << PCR_SDIO_SLAVE_RST_EN_S)
#define PCR_SDIO_SLAVE_RST_EN_V  0x00000001U
#define PCR_SDIO_SLAVE_RST_EN_S  1

/** PCR_SDIO_SLAVE_PD_CTRL_REG register
 *  LEDC power control register
 */
#define PCR_SDIO_SLAVE_PD_CTRL_REG (DR_REG_PCR_BASE + 0x15c)
/** PCR_SDIO_MEM_FORCE_PU : R/W; bitpos: [1]; default: 1;
 *  Set this bit to force power down SDIO memory.
 */
#define PCR_SDIO_MEM_FORCE_PU    (BIT(1))
#define PCR_SDIO_MEM_FORCE_PU_M  (PCR_SDIO_MEM_FORCE_PU_V << PCR_SDIO_MEM_FORCE_PU_S)
#define PCR_SDIO_MEM_FORCE_PU_V  0x00000001U
#define PCR_SDIO_MEM_FORCE_PU_S  1
/** PCR_SDIO_MEM_FORCE_PD : R/W; bitpos: [2]; default: 0;
 *  Set this bit to force power up SDIO memory.
 */
#define PCR_SDIO_MEM_FORCE_PD    (BIT(2))
#define PCR_SDIO_MEM_FORCE_PD_M  (PCR_SDIO_MEM_FORCE_PD_V << PCR_SDIO_MEM_FORCE_PD_S)
#define PCR_SDIO_MEM_FORCE_PD_V  0x00000001U
#define PCR_SDIO_MEM_FORCE_PD_S  2

/** PCR_DATE_REG register
 *  Date register.
 */
#define PCR_DATE_REG (DR_REG_PCR_BASE + 0xffc)
/** PCR_DATE : R/W; bitpos: [27:0]; default: 37823120;
 *  PCR version information.
 */
#define PCR_DATE    0x0FFFFFFFU
#define PCR_DATE_M  (PCR_DATE_V << PCR_DATE_S)
#define PCR_DATE_V  0x0FFFFFFFU
#define PCR_DATE_S  0

#ifdef __cplusplus
}
#endif
